app/controllers/api/v1/categories_controller.rb

      def set_sheet
        @sheet = current_user.expense_sheets.find(params[:sheetId])
---
SELECT "expense_sheets".* FROM "expense_sheets" WHERE "expense_sheets"."user_id" = $1 AND "expense_sheets"."id" = $2 LIMIT $3  [["user_id", "2e163c71-b6df-4640-b16d-d81ce1375d54"], ["id", "45678914-8501-4a9d-9563-be6c036f95d1"], ["LIMIT", 1]]