app/controllers/dashboard_controller.rb

  def index
    if user_signed_in?
      @expense_sheets = current_user.expense_sheets.ordered.includes(:expenses)
      @current_sheet = @expense_sheets.first

      if @current_sheet
        @current_month = Date.today.beginning_of_month
        @expenses = @current_sheet.expenses.for_month(@current_month.month, @current_month.year).ordered
---
SELECT "expense_sheets".* FROM "expense_sheets" WHERE "expense_sheets"."user_id" = $1 ORDER BY "expense_sheets"."created_at" DESC LIMIT $2  [["user_id", "2e163c71-b6df-4640-b16d-d81ce1375d54"], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."expense_sheet_id" IN ($1, $2, $3)  [["expense_sheet_id", "f3e21012-ad38-437c-a749-b9bcedb08e93"], ["expense_sheet_id", "f0617cf0-0ef9-45e7-80e4-99f1b7bd3928"], ["expense_sheet_id", "4d2c3045-df87-44fc-aaf7-b1af241c3737"]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."expense_sheet_id" = $1  [["expense_sheet_id", "f3e21012-ad38-437c-a749-b9bcedb08e93"]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."expense_sheet_id" = $1 AND "expenses"."date" BETWEEN $2 AND $3 ORDER BY "expenses"."date" DESC  [["expense_sheet_id", "f3e21012-ad38-437c-a749-b9bcedb08e93"], ["date", "2026-01-01"], ["date", "2026-01-31"]]

  def calculate_analytics(sheet)
    return {} unless sheet

    current_date = Date.today
    current_expenses = sheet.expenses.for_month(current_date.month, current_date.year)
    previous_month = current_date - 1.month
    previous_expenses = sheet.expenses.for_month(previous_month.month, previous_month.year)

    {
      category_totals: current_expenses.group(:category).sum(:amount),
      current_month_total: current_expenses.sum(:amount),
      previous_month_total: previous_expenses.sum(:amount)
---
SELECT SUM("expenses"."amount") AS "sum_amount", "expenses"."category" AS "expenses_category" FROM "expenses" WHERE "expenses"."expense_sheet_id" = $1 AND "expenses"."date" BETWEEN $2 AND $3 GROUP BY "expenses"."category"  [["expense_sheet_id", "f3e21012-ad38-437c-a749-b9bcedb08e93"], ["date", "2026-01-01"], ["date", "2026-01-31"]]