app/controllers/expense_sheets_controller.rb

  def show
    @current_month = params[:month] ? Date.parse(params[:month] + "-01") : Date.today.beginning_of_month
    @expenses = @expense_sheet.expenses.for_month(@current_month.month, @current_month.year).ordered
---
SELECT "expenses"."id" FROM "expenses" WHERE "expenses"."expense_sheet_id" = $1 AND "expenses"."date" BETWEEN $2 AND $3 ORDER BY "expenses"."date" DESC  [["expense_sheet_id", "f0617cf0-0ef9-45e7-80e4-99f1b7bd3928"], ["date", "2026-01-01"], ["date", "2026-01-31"]]

  def create
    @expense_sheet = current_user.expense_sheets.build(expense_sheet_params)

    if @expense_sheet.save
---
INSERT INTO "expense_sheets" ("name", "pin", "has_pin", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def set_expense_sheet
    @expense_sheet = current_user.expense_sheets.find(params[:id])
---
SELECT "expense_sheets".* FROM "expense_sheets" WHERE "expense_sheets"."user_id" = $1 AND "expense_sheets"."id" = $2 LIMIT $3  [["user_id", "2e163c71-b6df-4640-b16d-d81ce1375d54"], ["id", "f0617cf0-0ef9-45e7-80e4-99f1b7bd3928"], ["LIMIT", 1]]

  def create_default_categories(sheet)
    default_categories = %w[food transport utilities entertainment shopping healthcare education savings other]
    default_categories.each_with_index do |name, index|
      sheet.sheet_categories.create!(name: name, display_order: index)
---
INSERT INTO "sheet_categories" ("expense_sheet_id", "name", "display_order", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["expense_sheet_id", "37a7499a-1f1b-42a5-a8ab-f9a71c424a1e"], ["name", "food"], ["display_order", 0], ["created_at", "2026-01-18 08:59:59.874485"], ["updated_at", "2026-01-18 08:59:59.874485"]]