app/controllers/expenses_controller.rb

  def create
    @expense = @expense_sheet.expenses.build(expense_params)
    @expense.user = current_user

    respond_to do |format|
      if @expense.save
---
INSERT INTO "expenses" ("date", "amount", "category", "description", "user_id", "expense_sheet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def set_expense_sheet
    @expense_sheet = current_user.expense_sheets.find(params[:expense_sheet_id])
---
SELECT "expense_sheets".* FROM "expense_sheets" WHERE "expense_sheets"."user_id" = $1 AND "expense_sheets"."id" = $2 LIMIT $3  [["user_id", "2e163c71-b6df-4640-b16d-d81ce1375d54"], ["id", "f3e21012-ad38-437c-a749-b9bcedb08e93"], ["LIMIT", 1]]