app/models/expense_sheet.rb

INSERT INTO "sheet_categories" ("expense_sheet_id", "name", "display_order", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["expense_sheet_id", "c53e42a9-2927-4a38-bca6-954fcdcf21c4"], ["name", "food"], ["display_order", 0], ["created_at", "2026-01-18 09:26:00.702907"], ["updated_at", "2026-01-18 09:26:00.702907"]]
---
  def create_default_categories
    DEFAULT_CATEGORIES.each_with_index do |category_name, index|
      sheet_categories.create!(name: category_name, display_order: index)