app/models/user.rb

  def self.from_omniauth(auth)
    where(google_id: auth.uid).first_or_create do |user|
---
INSERT INTO "users" ("email", "encrypted_password", "name", "picture", "google_id", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."google_id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["google_id", "102876609167163298293"], ["LIMIT", 1]]