app/views/expense_sheets/show.html.erb

SELECT "expense_sheets".* FROM "expense_sheets" WHERE "expense_sheets"."user_id" = $1 ORDER BY "expense_sheets"."created_at" DESC  [["user_id", "2e163c71-b6df-4640-b16d-d81ce1375d54"]]
---
        <nav class="space-y-1">
          <% current_user.expense_sheets.ordered.each do |sheet| %>